package Summary_17_01_2025;

public class Main {
    public static void main(String[] args) {

    }
}


/*
1. Имеется много текстовых файлов большого объема. Реализовать метод поиска заданных слов.
В результате должно выводиться имя файла, номер строки и номер символа начала данного слова.
Сделать вычисления параллельными.
2. Имеется класс lesson20240924.inheritance.Human. Через рефлексию
- вызвать методы introduce(), feedAnimal(Animal animal)
- создать экземпляр класса
3. Имеется класс lesson20241119.hometasks.Jokes. Через рефлексию
заменить список исходных шуток в классе.
 */