package org.example.Homework_15_11_2024.Task1;

import java.util.ArrayList;
import java.util.List;

public class Reservuar {
    List<String> inputList = new ArrayList<>();

    public List<String> getInputList() {
        inputList.add("- А ты пополнела! - Да просто юбка пышная! - На лице?\n");
        inputList.add("Ирис \"Крепыш\" - запишись к стоматологу заранее!\n" );
        inputList.add("Незнание закона не освобождает от ответственности. Знание - запросто\n");
        inputList.add("- Милая, выпьем вечерком 2-3 коктейля? - Дурачок, 23 пишется слитно.\n");
        inputList.add("Всем моим поступкам есть только одно объяснение - это же я.\n");
        inputList.add("Людей, которые никогда не смеются, нельзя воспринимать всерьез.\n");
        inputList.add("Учитель - профессия от бога, только вот зарплаты от государства.\n");
        inputList.add("Человек треть жизни проводит во сне. Остальные две трети - мечтает выспаться.\n");
        inputList.add("— Милый, а хочешь, я подарю тебе свое сердце?— Ты мне сперва нервы верни.\n");
        inputList.add("Женщина — пример творческого подхода к созданию проблем.\n");
        inputList.add("Два ученика гоняют под окнами дома футбольный мяч. — Что за ругань у вас в квартире? — спрашивает один. — Это мой деда объясняет отцу, как надо решать мою задачку по арифметике.\n");
        return inputList;
    }
}
