package Homework_08_11_2024.Task2;

public class TextContein {
    private  String text = "Массовое пермское вымирание (также известное как Позднепермское вымирание, Последнее " +
            "пермское вымирание," +
                " неформально именуемое как англ. The Great Dying — Великое вымирание[1], или как англ. The Greatest Mass Extinction of All Time — " +
                "величайшее массовое вымирание всех времён[2]) — одно из пяти массовых вымираний. По нему проведена граница между пермским и " +
                "триасовым геологическими периодами (оно же разделяет палеозойскую и мезозойскую эры). Возраст этой границы по современной " +
                "геохронологической шкале — 251,902 ± 0,024 млн лет[3]." +
                "Является самой крупной катастрофой биосферы в истории Земли[4][5], которая привела к вымиранию 57 % биологических семейств," +
                " 83 % биологических родов, 81 % морских видов[6][7][8] и 70 % видов наземных позвоночных[9]. Согласно некоторым исследованиям," +
                " произошло вымирание 96 % всех морских видов[10]. Катастрофа стала единственным известным массовым вымиранием насекомых[11]," +
                " в результате которого вымерло около 57 % родов и 83 % видов всего класса. Пермское вымирание стало крупнейшим из «большой " +
                "пятерки» массовых вымираний фанерозоя[12]. Есть свидетельства существования одного-трёх отдельных импульсов или фаз вымирания." +
                "[9][13";

    public TextContein() {
        this.text = text;
    }

    public String getText() {
        return text;
    }
}
